In [1]:
import pandas as pd

In [2]:
s = pd.Series([1,2,3,4], index=["가", "나", "다", "라"])
s

가    1
나    2
다    3
라    4
dtype: int64

In [3]:
pd.Series(range(10))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [4]:
s.index

Index(['가', '나', '다', '라'], dtype='object')

In [5]:
s.values

array([1, 2, 3, 4], dtype=int64)

In [6]:
s.name = "샘플"
s.index.name = "인덱스"
s

인덱스
가    1
나    2
다    3
라    4
Name: 샘플, dtype: int64

In [7]:
s % 3

인덱스
가    1
나    2
다    0
라    1
Name: 샘플, dtype: int64

In [8]:
s[1], s['나']

(2, 2)

In [9]:
s[[0,2]]

인덱스
가    1
다    3
Name: 샘플, dtype: int64

In [10]:
s[['가', '라']]

인덱스
가    1
라    4
Name: 샘플, dtype: int64

In [11]:
s[(2<s) & (s<5)]

인덱스
다    3
라    4
Name: 샘플, dtype: int64

In [12]:
s[1:4]

인덱스
나    2
다    3
라    4
Name: 샘플, dtype: int64

In [13]:
s.다

3

In [14]:
'바' in s

False

In [15]:
for k,v in s.items():
    print("%s = %d" % (k,v))

가 = 1
나 = 2
다 = 3
라 = 4

In [16]:
s2 = pd.Series({"가": 1, "나": 2, "다": 3, "바": 4})
s2

가    1
나    2
다    3
바    4
dtype: int64

In [17]:
s2 = pd.Series({"가": 1, "나": 2, "다": 3, "바": 4}, index=['나','가','바','다'])
s2

나    2
가    1
바    4
다    3
dtype: int64

In [18]:
minus = s - s2
minus

가    0.0
나    0.0
다    0.0
라    NaN
바    NaN
dtype: float64

In [19]:
s.values - s2.values

array([-1,  1, -1,  1], dtype=int64)

In [20]:
minus.notnull()

가     True
나     True
다     True
라    False
바    False
dtype: bool

In [21]:
minus[minus.notnull()]

가    0.0
나    0.0
다    0.0
dtype: float64

In [22]:
s['차'] = 24
s

인덱스
가     1
나     2
다     3
라     4
차    24
Name: 샘플, dtype: int64

In [23]:
del s['차']
s

인덱스
가    1
나    2
다    3
라    4
Name: 샘플, dtype: int64

In [24]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역","2000","2005", "2010", "2015", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2000     2005     2010     2015  2010-2015 증가율
서울  수도권  9853972  9762546  9631482  9904312         0.0283
부산  경상권  3655437  3512547  3393191  3448737         0.0163
인천  수도권  2466338  2517680  2632035  2890451         0.0982
대구  경상권  2473990  2456016  2431774  2466052         0.0141

In [25]:
df.values

array([['수도권', 9853972, 9762546, 9631482, 9904312, 0.0283],
       ['경상권', 3655437, 3512547, 3393191, 3448737, 0.0163],
       ['수도권', 2466338, 2517680, 2632035, 2890451, 0.0982],
       ['경상권', 2473990, 2456016, 2431774, 2466052, 0.0141]], dtype=object)

In [26]:
df.columns

Index(['지역', '2000', '2005', '2010', '2015', '2010-2015 증가율'], dtype='object')

In [27]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [28]:
df.T

                    서울       부산       인천       대구
지역                 수도권      경상권      수도권      경상권
2000           9853972  3655437  2466338  2473990
2005           9762546  3512547  2517680  2456016
2010           9631482  3393191  2632035  2431774
2015           9904312  3448737  2890451  2466052
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [29]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

     지역     2000     2005     2010     2015  2010-2015 증가율
서울  수도권  9853972  9762546  9631482  9904312           2.83
부산  경상권  3655437  3512547  3393191  3448737           1.63
인천  수도권  2466338  2517680  2632035  2890451           9.82
대구  경상권  2473990  2456016  2431774  2466052           1.41

In [30]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

     지역     2000     2005     2010     2015  2010-2015 증가율  2005-2010 증가율
서울  수도권  9853972  9762546  9631482  9904312           2.83          -1.34
부산  경상권  3655437  3512547  3393191  3448737           1.63          -3.40
인천  수도권  2466338  2517680  2632035  2890451           9.82           4.54
대구  경상권  2473990  2456016  2431774  2466052           1.41          -0.99

In [31]:
del df['2005-2010 증가율']

In [32]:
#여러개의 열을 반환하려면 열을 배열에 넣어 조회한다
df[['지역','2000']]

     지역     2000
서울  수도권  9853972
부산  경상권  3655437
인천  수도권  2466338
대구  경상권  2473990

In [33]:
#데이터 프래임 형식을 그대로 유지할 때 사용
df[['지역']]

     지역
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [34]:
import numpy as np
df2 = pd.DataFrame(np.arange(1,13).reshape(3,4))
df2

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [35]:
df2[1:2]

   0  1  2  3
1  5  6  7  8

In [36]:
df2[1][1]

6

In [37]:
result = {
    '인덱싱 값' : ['라벨', '라벨 리스트', '인덱스 데이터', '인덱스 데이터 슬라이스'],
    '가능' : ['O', 'O', 'X', 'O'],
    '결과': ['열', '열', '', '열'],
    '자료형': ['시리즈', '데이터프레임', '', '데이트프레임'],
    '추가사항': ['','','정수일 경우 라벨 인덱싱','']
}
columns = ['인덱싱 값', '가능', '결과', '자료형', '추가사항']
result = pd.DataFrame(result)
result

          인덱싱 값 가능 결과     자료형           추가사항
0            라벨  O  열     시리즈
1        라벨 리스트  O  열  데이터프레임
2       인덱스 데이터  X             정수일 경우 라벨 인덱싱
3  인덱스 데이터 슬라이스  O  열  데이트프레임